<script setup>
import {useRouter} from "vue-router";
import { ref } from "vue";
import OpenAI from "openai"

const router = useRouter()

const goToTask = async () => {
  await router.push('/posts')
}

// const clientId = 'ваш_client_id';
// const redirectUri = 'https://ваш_сайт/callback'; // Должен совпадать с настройками в HH
// const hhAuthUrl = `https://hh.ru/oauth/authorize?response_type=code&client_id=${clientId}&redirect_uri=${redirectUri}`;

const answers = ref('')

const wac = `Мы аккредитованная ИТ-компания Smartdata.dev, занимаемся разработкой отраслевых продуктов в сфере обращения с отходами, в сфере экотуризма, а так же создаем корпоративные продукты для управления предприятием.

Ищем в команду Иркутска разработчика на Cuba платформе (Jmix). Рассматриваем кандидатов в Иркутском часовом поясе.

Чем предстоит заниматься:

Разработка и доработка систем;
Реализация интеграционных решений;
Оптимизация существующих решений, повышение отказоустойчивости систем;
Что мы ждём от кандидата:

профильное высшее образование;
опыт работы Java-разработчиком от 2 лет;
опыт работы с БД PostgreSQL и написание сложных SQL-запросов;
знание Spring Framework;
навыки работы с Git;
опыт работы с CUBA/JMIX Platform для разработки корпоративных приложений - будет как преимущество.
Что мы гарантируем тебе:

гибкую вилку по з/п в соответствии с твоим профессиональным уровнем middle/senior/team lead (по результатам тех.собеседования);
система квартальных и годовых премий;
фуллтайм с гибко настраиваемый графиком дня;
возможность работать удаленно или в офисе (в Иркутске, в Улан-Удэ);
поддержка участия в активностях от it-сообществ, в прохождение обучения, сертификации и пр;
трудовой договор (возможно оформление как самозанятого).
Ждём твой отклик на вакансию!

В нашей команде более 80 сотрудников: Java, React, Vue, Flutter, 1C, UX, QA, Devops, машинное обучение.

Присоединяйся к команде smartdata.dev!`


const wac2 = `О нас

Мы — Playerok.com, C2C маркетплейс игровых товаров и услуг. Наша платформа предоставляет пользователям возможность покупать и продавать игровые товары и услуги, создавая уникальные условия для геймеров.

Кого мы ищем

Ищем человека на позицию Frontend Developer (уровня Middle), который будет работать в связке с текущим Frontend-разработчиком (уровень Middle) и Frontend-разработчиком (уровень Senior), решая задачи по оптимизации приложения под руководством Техлида.

Чем предстоит заниматься

Разработка новых фичей;
Работа над улучшением и оптимизацией работы продукта;
Проведение код-ревью;
Взаимодействие с остальной командой - дизайнером, backend-разработчиками, тестировщиком, продактами.
Для нас важно

Коммерческий опыт TypeScript/React от 2-х лет;
Опыт работы с Next.js;
Опыт работы с UI компонентами: MUI, CSS in JS approach;
Понимание архитекртурной методологии FSD.
Будет плюсом

Опыт работы webpack, computer science, nodejs;
Опыт работы с библиотекой effector.
Что предлагаем

Полностью удаленный формат работы. Можно работать из любой точки мира;

Оплата от 250.000 руб (финальная сумма обсуждается на встрече с успешным кандидатом);

Возможность выбрать форму сотрудничества и оплаты (налог оплачивает компания);

Полная занятость с графиком 5/2 (8-часовой рабочий день);

Предпочтительное рабочее время: 11:00-20:00 по Мск;

Инициативная команда;

Оплачиваемый отпуск/больничный;

Ежегодная индексация оплаты.`

const me = ` у меня 4 летний опыт работы во "фронте", как в продуктовой так и в аутсорс разработке.

Касательно опыта - текущий стек выглядит следующим образом:
- Vue 3 (3 года опыта/ Compositions API)
- JavaScript (3 года опыта / сложная бизнес логика)
- TypeScript (1 год опыта / статическая типизация / дженерики)
- Pinia / Vuex (2 года опыта)
- Vue router / SPA (2 года опыта)
- Vuetify / Quasar (+capacitor) (2 года опыта)
- Vite / Webpack (3 года опыта / настройка конфигов и сборок)
- HTML5 / CSS3 / SASS & SCSS (4 года опыта)
- RestAPI (3 года опыта)

Не основное
- Yarn / NPM / Docker
- Git / Trello / Figma / Slack / ActiveCollab / Confluence
- ООП / DRY / BEM / SOLID

Ещё работал с такими технологиями, но без коммерческого опыта:
- React
- WebSocket
- Node.js
- Nuxt / SSR
- PostgreSQL / MySQL`



const client = new OpenAI({
  baseURL: "https://api.scaleway.ai/32cc3102-a1b3-44f4-bfee-31d571260fc2/v1",
  apiKey: import.meta.env.VITE_OPENAI_API_KEY,
  dangerouslyAllowBrowser: true
});

async function complete_request() {
  const stream = await client.chat.completions.create({
    model:"deepseek-r1-distill-llama-70b",
    messages: [
      { "role": "system", "content": "Ты специалист в подборе вакансий и написанию сопроводительных писем" },
      { "role": "user",
        "content": `Есть вакансия. Надо сравнить мой опыт и требуемый. Если я подхожу на более чем 60%, составь
                   сопроводительное письмо исходя из опыта и требований(только само письмо без оформления и других слов,
                   чтобы я скопировал ответ и вставил и там не было ничего лишнего. И надо сделать в 700-900 слов).
                   Если нет, ответь просто "false" (чтобы я отфильтровал вакансии по твоему ответу). Вот вакансия:
                   ${wac2}. А вот мой опыт: ${me}`
      },
    ],
    max_tokens: 3000,
    temperature: 0.6,
    top_p: 0.5,
    presence_penalty: 0,
    stream: true,
  })
  for await (const chunk of stream) {
    answers.value += chunk.choices[0]?.delta?.content || ''
  }
}

// complete_request()
</script>

<template>
  <div class="welcome">
    <h1>🤚 Привет, меня зовут Егор, а это мое тестовое задание</h1>
    <div class="welcome__section">
      {{ answers }}
    </div>
    <button @click="goToTask">goToTask</button>
  </div>
</template>

<style lang="scss" scoped>
.welcome {
  text-align: center;

  &__section {
    display: flex;
    gap: 20px;
  }

  &__side {
    display: flex;
    flex-direction: column;
    align-items: flex-end;
    flex: 1 1 0;

    &.revert {
      align-items: flex-start;
    }
  }

  &__img {
    width: 212px;
    height: 378px;
  }
}
</style>